Ran Plan for dir: `.` workspace: `production`

<details><summary>Show Output</summary>

```diff
module.kubernetes.module.postgresql.kubernetes_job.run_sql_scripts: Drift detected (delete)
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "do_not_use_in_code" but
│ a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-GXBA8KukGFfvM9cX/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Resource targeting is in effect
│
│ You are creating a plan with the -target option, which means that the
│ result of this plan may not represent all of the changes requested by the
│ current configuration.
│
│ The -target option is not for routine use, and is provided only for
│ exceptional situations such as recovering from errors or mistakes, or when
│ Terraform specifically suggests to use it as part of an error message.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # module.kubernetes.module.postgresql.helm_release.postgresql will be updated in-place
~ resource "helm_release" "postgresql" {
        id                         = "postgresql"
      ~ metadata                   = [
          - {
              - app_version = "16.1.0"
              - chart       = "postgresql"
              - name        = "postgresql"
              - namespace   = "postgresql"
              - revision    = 1
              - values      = jsonencode(
                    {
                      - auth              = {
                          - database           = "thirtyinches"
                          - enablePostgresUser = true
                          - password           = "sknkpassword"
                          - postgresPassword   = "sknkadmin"
                          - username           = "sknkuser"
                        }
                      - metrics           = {
                          - enabled = true
                        }
                      - primary           = {
                          - persistence = {
                              - size         = "3Gi"
                              - storageClass = "local-storage-class"
                            }
                        }
                      - volumePermissions = {
                          - enabled = true
                        }
                    }
                )
              - version     = "13.2.24"
            },
        ] -> (known after apply)
        name                       = "postgresql"
      ~ values                     = [
          - (sensitive value),
          + (sensitive value),
        ]
        # (26 unchanged attributes hidden)
    }

  # module.kubernetes.module.postgresql.kubernetes_job.run_sql_scripts will be created
+ resource "kubernetes_job" "run_sql_scripts" {
      + id                  = (known after apply)
      + wait_for_completion = true

      + metadata {
          + generation       = (known after apply)
          + labels           = (known after apply)
          + name             = "run-sql-scripts"
          + namespace        = "postgresql"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + backoff_limit              = 1
          + completion_mode            = (known after apply)
          + completions                = 1
          + parallelism                = 1
          + ttl_seconds_after_finished = "120"

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }
              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Never"
                  + scheduler_name                   = (known after apply)
                  + service_account_name             = (known after apply)
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + container {
                      + command                    = [
                          + "psql",
                          + "-h",
                          + "postgresql.postgresql",
                          + "-d",
                          + "thirtyinches",
                          + "-f",
                          + "/scripts/thirtyinches_schema.sql",
                        ]
                      + image                      = "postgres:alpine"
                      + image_pull_policy          = (known after apply)
                      + name                       = "postgres-client"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + env {
                          + name  = "PGUSER"
                          + value = (sensitive value)
                        }
                      + env {
                          + name  = "PGPASSWORD"
                          + value = (sensitive value)
                        }

                      + volume_mount {
                          + mount_path        = "/scripts"
                          + mount_propagation = "None"
                          + name              = "sql-scripts-volume"
                          + read_only         = false
                        }
                    }

                  + volume {
                      + name = "sql-scripts-volume"

                      + config_map {
                          + default_mode = "0644"
                          + name         = "sql-scripts"
                        }
                    }
                }
            }
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -w production`
* :put_litter_in_its_place: To **delete** this plan click [here](http://144.24.128.160:4141/lock?id=1995navinkumar%252Fterraform%252F.%252Fproduction)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -w production -- -target=module.kubernetes.module.postgresql`
</details>
Plan: 1 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`